import 'dart:math';

import 'package:des_mobile_admin_v3/shared/extension.dart';
import 'package:des_mobile_admin_v3/shared/secure_storage.dart';

const List<dynamic> mockDataList = [
  mockDataObject3,
  mockDataObject4,
  mockDataObject1,
  mockDataObject2,
];
const dynamic mockDataObject1 = {
  'title': 'สกัดสมุนไพร เพื่อผลิตภัณฑ์เสริมความงาม',
  'imageUrl': 'http://122.155.223.63/td-doc/images/des/des_mock2.png',
  'createBy': 'เจ้าหน้าที่ศูนย์ดิติทัลชุมชน',
  'createDate': '20230109',
  'view': 5,
  'description':
      '''คอร์สนี้คุณจะได้เรียนวิธีการนำสมุนไพรไทยในรูปแบบต่างๆ มาสกัดเพื่อให้ได้สารสำคัญไปใช้ในผลิตภัณฑ์เสริมความงาม สมุนไพรที่นำมาสกัดมีหลากหลายรูปแบบ ครอบคลุมทั้งสมุนไพรไทยและสมุนไพรจีน ที่มีสรรพคุณช่วยบำรุงผิวพรรณ ฟื้นฟูสภาพผิว ต้านอนุมูลอิสระ ลบเลือนรอยดำต่างๆ เพื่อนำไปประยุกต์ใช้กับผลิตภัณฑ์แฮนด์เมดต่างๆ หรือใครที่ต้องการเรียนรู้การสกัดสมุนไพรเพื่อนำไปจัดจำหน่ายในรูปแบบของสารสกัด ให้กับคนที่ขาดแคลนวัตถุดิบ
ในคอร์สนี้คุณจะได้เรียนกับอาจารย์ภาควิชาเคมี โดยที่อาจารย์ได้ทำการทดลองในห้องปฏิบัติการแล้ว โดยมีงานวิจัยอ้างอิงและครูเรได้นำมาทำให้อยู่ในรูปแบบอย่างง่ายที่ทุกคนสามารถสกัดได้ โดยปรับใช้/ประยุกต์ใช้กับอุปกรณ์ในครัวเรือนที่ปรับใช้ให้ถูกหลักการทางวิทยาศาสตร์และที่สำคัญในห้องเรียนนี้ อาจารย์จะสอนให้คุณทำการทดสอบสารสำคัญว่าสารที่สกัดมานั้นมีสารสำคัญชนิดนั้นอยู่จริงหรือไม่
คอร์สเรียนนี้เหมาะอย่างยิ่งสำหรับคนที่อยากจะทำสารสกัดเพื่อส่งเสริมผลิตภัณฑ์ของตัวเอง และสำหรับคนที่อยากจะเรียนเพื่อนำความรู้ไปไว้ตอบลูกค้าว่าได้สารสกัดแต่ละชนิดมาได้โดยวิธีการใด และสามารถตรวจสอบสารสำคัญได้จริงหรือไม่ รวมไปถึงคนที่ยังทำงานแฮนด์เมดไม่เป็น แต่อยู่ในแหล่งวัตถุดิบ อยากจะแปรรูปสมุนไพรของตัวเองให้อยู่ในรูปสารสกัด โดยเฉพาะคนที่ทำนาข้าว สามารถแปรรูปข้าวให้ได้สารสกัดที่ดีต่อผิว เพิ่มความชุ่มชื้น มีสารต้านอนุมูลอิสระ คืนความอ่อนเยาว์ให้แก่ผิว
คอร์สเรียนนี้คุณจะได้เรียนรู้การสกัดสมุนไพรแทบทุกประเภทไม่ว่าจะเป็น แบบสดฉ่ำน้ำ แบบสดไม่ฉ่ำน้ำ พืชสมุนไพรที่เป็นหัว หรือพืชสมุนไพรที่มีน้ำมันหอมระเหย นอกจากนี้ยังมีสมุนไพรแบบสดและแบบแห้ง
คุณจะได้เรียนรู้การสกัดสมุนไพรที่เหมาะสมสำหรับผลิตภัณฑ์แต่ละชนิด พร้อมกับสอนให้ทุกคนรู้จักการต่อยอดจากสิ่งที่สอนอีกด้วย
ดังนั้นในห้องเรียนนี้ คุณจะได้พบกับการเรียนรู้วิธีสกัดสมุนไพร ที่ครอบคลุมตั้งแต่พื้นฐาน ไปถึงขั้นต่อยอดงานวิจัย ที่ตั้งใจสอนให้ทุกคนทำง่าย ทำเป็น เข้าถึงได้ง่าย
ประโยชน์ที่ผู้เรียนจะได้รับ
1) ลดรายจ่าย จากการซื้อสารสกัดสมุนไพร
2) เพิ่มรายได้จากการขายสารสกัดสมุนไพร
3) ได้สารสกัดสมุนไพรที่มีคุณภาพ มีมาตรฐาน ตรวจสอบคุณภาพได้ และทำได้ด้วยตัวเอง
4) ได้เรียนรู้การค้นหาจุดขายของผลิตภัณฑ์แฮนด์เมด
5) เรียนรู้การใช้งานวิจัย เพื่ออ้างอิงผลิตภัณฑ์แฮนด์เมดที่เราผลิต
6) เรียนรู้การตลาดในการขายผลิตภัณฑ์เครื่องสำอางเสริมความงาม
7) สามารถตอบคำถามเชิงลึกเกี่ยวกับผลิตภัณฑ์ที่เราผลิตหรือขาย ให้กับลูกค้าของเราได้
8) สามารถประยุกต์การสกัดสมุนไพร ได้กับสมุนไพรทุกชนิด ทุกประเภท
9) สามารถนำผัก ผลไม้ สมุนไพรใกล้ตัวมาสร้างมูลค่าเพิ่ม
10) สามารถนำความรู้ไปถ่ายทอดให้กับผู้อื่น เป็นวิทยากรในชุมชน หรือสร้างคอร์สออนไลน์สอนผู้ที่สนใจต่อไป
ใครควรเรียนคอร์สออนไลน์นี้
1) คนที่ทำงานในวงการเเฮนด์เมด คนทำผลิตภัณฑ์เครื่องสำอาง ผู้ผลิต ผู้ประกอบการ ที่ใช้สารสกัดสมุนไพรในผลิตภัณฑ์ เพื่อลดค่าใช้จ่ายในการซื้อสารสกัด และมั่นใจในคุณภาพ
2) คนที่มีวัตถุดิบ อยู่ในแหล่งวัตถุดิบ มีสมุนไพร หรือหาสมุนไพรใกล้ตัวได้ง่าย เพื่อผลิตสารสกัดสมุนไพรชนิดต่างๆ ออกจำหน่ายให้ผู้ผลิตเครื่องสำอางและงานเเฮนด์เมด
3) เจ้าของฟาร์ม สวนเกษตร เเหล่งเรียนรู้ชุมชน ผู้นำชุมชน ที่จะเรียนรู้การสกัดสมุนไพรเพื่อนำความรู้ไปต่อยอดขยายผลในชุมชน เพื่อสร้างแหล่งเรียนรู้ เเหล่งท่องเที่ยวเเนวใหม่ เชิงการให้ความรู้
4) ครู อาจารย์ หรือผู้ที่อยู่ในวงการการศึกษา ที่จะนำความรู้ไปขยายผลกับนักเรียนหรือหน่วยงานราชการ
5) บุคคลทั่วไปที่อยากจะสร้างคอร์สออนไลน์ หรืออยากสร้างตัวตนผ่านโลกออนไลน์ ในรูปแบบของการให้ความรู้การสกัดสมุนไพร ที่กำลังเป็นที่นิยมของผู้คน
6) คนทำงานประจำที่อยากจะค้นหาอาชีพเสริม
7) คนที่สนใจผลิตภัณฑ์เพื่อสุขภาพและความงาม
8) คนที่รู้กระเเสสมุนไพรไทยที่มาแรงและสร้างรายได้อย่างยั่งยืน
9) คนที่เห็นช่องทางตลาดขนาดใหญ่ และความน่าสนใจของผลิตภัณฑ์จากสมุนไพรไทย
10) คนที่อยากค้นหาตัวตน เเละความชอบ รวมถึงช่องทางสร้างรายได้จากสมุนไพร
ผู้เรียนต้องมีความรู้อะไรมาก่อน
ไม่จำเป็นต้องมีความรู้ หรือพื้นฐานใดๆ เพราะห้องเรียนนี้สอนตั้งแต่เริ่มต้น ปูพื้นฐานสำคัญ ไปจนถึงสอนสร้างองค์ความรู้แบบยั่งยืน จนสามารถต่อยอดได้จนถึงขั้นสูงสุด''',
};
const mockDataObject2 = {
  'title': 'ผลิตยาหม่องมณีพฤกษา ง่ายๆ ด้วยตัวเอง',
  'imageUrl': 'http://122.155.223.63/td-doc/images/des/des_mock1.png',
  'createBy': 'เจ้าหน้าที่ศูนย์ดิติทัลชุมชน',
  'createDate': '20230104',
  'view': 500,
  'description':
      '''คอร์สสอนผลิตยาหม่องมณีพฤกษาด้วยตัวเอง ตํารับยาที่อยู่คู่ชาวไทยมาช้านาน ทำขายเองก็ได้ แจกฟรีตามงานก็ดี หรือจะส่งออกต่างประเทศก็ทำได้ หากคุณเรียนคอร์สนี้แล้ว คุณสามารถนําความรู้ที่ได้ไปประยุกต์ใช้เพื่อประกอบอาชีพเสริมได้
ประโยชน์ของคอร์สเรียน
- รู้ขั้นตอนทั้งหมด เพื่อให้สามารถผลิตยาหม่องมณีพฤกษาได้ด้วยตัวเอง
- สามารถนำความรู้ไปทำเป็นอาชีพได้
จำเป็นต้องมีความรู้ด้านใดมาก่อนหรือไม่
- ไม่จำเป็นต้องมีความรู้ด้านใดมาก่อนก็เรียนได้''',
};

const dynamic mockDataObject3 = {
  'title':
      'ศูนย์ดิจิทัลชุมชนวัดเจียงอี  ให้บริการประชาชนทุกกลุ่ม ฟรี ไม่มีค่าใช้จ่าย',
  'imageUrl':
      'https://raot.we-builds.com/raot-document/images/event/event_232414294.png',
  'createBy': 'เจ้าหน้าที่ศูนย์ดิติทัลชุมชน',
  'createDate': '20230112',
  'view': 5,
  'description':
      '''คอร์สนี้คุณจะได้เรียนวิธีการนำสมุนไพรไทยในรูปแบบต่างๆ มาสกัดเพื่อให้ได้สารสำคัญไปใช้ในผลิตภัณฑ์เสริมความงาม สมุนไพรที่นำมาสกัดมีหลากหลายรูปแบบ ครอบคลุมทั้งสมุนไพรไทยและสมุนไพรจีน ที่มีสรรพคุณช่วยบำรุงผิวพรรณ ฟื้นฟูสภาพผิว ต้านอนุมูลอิสระ ลบเลือนรอยดำต่างๆ เพื่อนำไปประยุกต์ใช้กับผลิตภัณฑ์แฮนด์เมดต่างๆ หรือใครที่ต้องการเรียนรู้การสกัดสมุนไพรเพื่อนำไปจัดจำหน่ายในรูปแบบของสารสกัด ให้กับคนที่ขาดแคลนวัตถุดิบ
ในคอร์สนี้คุณจะได้เรียนกับอาจารย์ภาควิชาเคมี โดยที่อาจารย์ได้ทำการทดลองในห้องปฏิบัติการแล้ว โดยมีงานวิจัยอ้างอิงและครูเรได้นำมาทำให้อยู่ในรูปแบบอย่างง่ายที่ทุกคนสามารถสกัดได้ โดยปรับใช้/ประยุกต์ใช้กับอุปกรณ์ในครัวเรือนที่ปรับใช้ให้ถูกหลักการทางวิทยาศาสตร์และที่สำคัญในห้องเรียนนี้ อาจารย์จะสอนให้คุณทำการทดสอบสารสำคัญว่าสารที่สกัดมานั้นมีสารสำคัญชนิดนั้นอยู่จริงหรือไม่
คอร์สเรียนนี้เหมาะอย่างยิ่งสำหรับคนที่อยากจะทำสารสกัดเพื่อส่งเสริมผลิตภัณฑ์ของตัวเอง และสำหรับคนที่อยากจะเรียนเพื่อนำความรู้ไปไว้ตอบลูกค้าว่าได้สารสกัดแต่ละชนิดมาได้โดยวิธีการใด และสามารถตรวจสอบสารสำคัญได้จริงหรือไม่ รวมไปถึงคนที่ยังทำงานแฮนด์เมดไม่เป็น แต่อยู่ในแหล่งวัตถุดิบ อยากจะแปรรูปสมุนไพรของตัวเองให้อยู่ในรูปสารสกัด โดยเฉพาะคนที่ทำนาข้าว สามารถแปรรูปข้าวให้ได้สารสกัดที่ดีต่อผิว เพิ่มความชุ่มชื้น มีสารต้านอนุมูลอิสระ คืนความอ่อนเยาว์ให้แก่ผิว
คอร์สเรียนนี้คุณจะได้เรียนรู้การสกัดสมุนไพรแทบทุกประเภทไม่ว่าจะเป็น แบบสดฉ่ำน้ำ แบบสดไม่ฉ่ำน้ำ พืชสมุนไพรที่เป็นหัว หรือพืชสมุนไพรที่มีน้ำมันหอมระเหย นอกจากนี้ยังมีสมุนไพรแบบสดและแบบแห้ง
คุณจะได้เรียนรู้การสกัดสมุนไพรที่เหมาะสมสำหรับผลิตภัณฑ์แต่ละชนิด พร้อมกับสอนให้ทุกคนรู้จักการต่อยอดจากสิ่งที่สอนอีกด้วย
ดังนั้นในห้องเรียนนี้ คุณจะได้พบกับการเรียนรู้วิธีสกัดสมุนไพร ที่ครอบคลุมตั้งแต่พื้นฐาน ไปถึงขั้นต่อยอดงานวิจัย ที่ตั้งใจสอนให้ทุกคนทำง่าย ทำเป็น เข้าถึงได้ง่าย
ประโยชน์ที่ผู้เรียนจะได้รับ
1) ลดรายจ่าย จากการซื้อสารสกัดสมุนไพร
2) เพิ่มรายได้จากการขายสารสกัดสมุนไพร
3) ได้สารสกัดสมุนไพรที่มีคุณภาพ มีมาตรฐาน ตรวจสอบคุณภาพได้ และทำได้ด้วยตัวเอง
4) ได้เรียนรู้การค้นหาจุดขายของผลิตภัณฑ์แฮนด์เมด
5) เรียนรู้การใช้งานวิจัย เพื่ออ้างอิงผลิตภัณฑ์แฮนด์เมดที่เราผลิต
6) เรียนรู้การตลาดในการขายผลิตภัณฑ์เครื่องสำอางเสริมความงาม
7) สามารถตอบคำถามเชิงลึกเกี่ยวกับผลิตภัณฑ์ที่เราผลิตหรือขาย ให้กับลูกค้าของเราได้
8) สามารถประยุกต์การสกัดสมุนไพร ได้กับสมุนไพรทุกชนิด ทุกประเภท
9) สามารถนำผัก ผลไม้ สมุนไพรใกล้ตัวมาสร้างมูลค่าเพิ่ม
10) สามารถนำความรู้ไปถ่ายทอดให้กับผู้อื่น เป็นวิทยากรในชุมชน หรือสร้างคอร์สออนไลน์สอนผู้ที่สนใจต่อไป
ใครควรเรียนคอร์สออนไลน์นี้
1) คนที่ทำงานในวงการเเฮนด์เมด คนทำผลิตภัณฑ์เครื่องสำอาง ผู้ผลิต ผู้ประกอบการ ที่ใช้สารสกัดสมุนไพรในผลิตภัณฑ์ เพื่อลดค่าใช้จ่ายในการซื้อสารสกัด และมั่นใจในคุณภาพ
2) คนที่มีวัตถุดิบ อยู่ในแหล่งวัตถุดิบ มีสมุนไพร หรือหาสมุนไพรใกล้ตัวได้ง่าย เพื่อผลิตสารสกัดสมุนไพรชนิดต่างๆ ออกจำหน่ายให้ผู้ผลิตเครื่องสำอางและงานเเฮนด์เมด
3) เจ้าของฟาร์ม สวนเกษตร เเหล่งเรียนรู้ชุมชน ผู้นำชุมชน ที่จะเรียนรู้การสกัดสมุนไพรเพื่อนำความรู้ไปต่อยอดขยายผลในชุมชน เพื่อสร้างแหล่งเรียนรู้ เเหล่งท่องเที่ยวเเนวใหม่ เชิงการให้ความรู้
4) ครู อาจารย์ หรือผู้ที่อยู่ในวงการการศึกษา ที่จะนำความรู้ไปขยายผลกับนักเรียนหรือหน่วยงานราชการ
5) บุคคลทั่วไปที่อยากจะสร้างคอร์สออนไลน์ หรืออยากสร้างตัวตนผ่านโลกออนไลน์ ในรูปแบบของการให้ความรู้การสกัดสมุนไพร ที่กำลังเป็นที่นิยมของผู้คน
6) คนทำงานประจำที่อยากจะค้นหาอาชีพเสริม
7) คนที่สนใจผลิตภัณฑ์เพื่อสุขภาพและความงาม
8) คนที่รู้กระเเสสมุนไพรไทยที่มาแรงและสร้างรายได้อย่างยั่งยืน
9) คนที่เห็นช่องทางตลาดขนาดใหญ่ และความน่าสนใจของผลิตภัณฑ์จากสมุนไพรไทย
10) คนที่อยากค้นหาตัวตน เเละความชอบ รวมถึงช่องทางสร้างรายได้จากสมุนไพร
ผู้เรียนต้องมีความรู้อะไรมาก่อน
ไม่จำเป็นต้องมีความรู้ หรือพื้นฐานใดๆ เพราะห้องเรียนนี้สอนตั้งแต่เริ่มต้น ปูพื้นฐานสำคัญ ไปจนถึงสอนสร้างองค์ความรู้แบบยั่งยืน จนสามารถต่อยอดได้จนถึงขั้นสูงสุด''',
};

const dynamic mockDataObject4 = {
  'title':
      'รับสมัครผู้ดูแลศูนย์ดิจิทัลชุมชน กลุ่มที่ 4 ตามโครงการพัฒนาระบบนิเวศศูนย์ดิจิทัล',
  'imageUrl':
      'https://raot.we-builds.com/raot-document/images/event/event_232600678.png',
  'createBy': 'เจ้าหน้าที่ศูนย์ดิติทัลชุมชน',
  'createDate': '20230110',
  'view': 5,
  'description':
      '''คอร์สนี้คุณจะได้เรียนวิธีการนำสมุนไพรไทยในรูปแบบต่างๆ มาสกัดเพื่อให้ได้สารสำคัญไปใช้ในผลิตภัณฑ์เสริมความงาม สมุนไพรที่นำมาสกัดมีหลากหลายรูปแบบ ครอบคลุมทั้งสมุนไพรไทยและสมุนไพรจีน ที่มีสรรพคุณช่วยบำรุงผิวพรรณ ฟื้นฟูสภาพผิว ต้านอนุมูลอิสระ ลบเลือนรอยดำต่างๆ เพื่อนำไปประยุกต์ใช้กับผลิตภัณฑ์แฮนด์เมดต่างๆ หรือใครที่ต้องการเรียนรู้การสกัดสมุนไพรเพื่อนำไปจัดจำหน่ายในรูปแบบของสารสกัด ให้กับคนที่ขาดแคลนวัตถุดิบ
ในคอร์สนี้คุณจะได้เรียนกับอาจารย์ภาควิชาเคมี โดยที่อาจารย์ได้ทำการทดลองในห้องปฏิบัติการแล้ว โดยมีงานวิจัยอ้างอิงและครูเรได้นำมาทำให้อยู่ในรูปแบบอย่างง่ายที่ทุกคนสามารถสกัดได้ โดยปรับใช้/ประยุกต์ใช้กับอุปกรณ์ในครัวเรือนที่ปรับใช้ให้ถูกหลักการทางวิทยาศาสตร์และที่สำคัญในห้องเรียนนี้ อาจารย์จะสอนให้คุณทำการทดสอบสารสำคัญว่าสารที่สกัดมานั้นมีสารสำคัญชนิดนั้นอยู่จริงหรือไม่
คอร์สเรียนนี้เหมาะอย่างยิ่งสำหรับคนที่อยากจะทำสารสกัดเพื่อส่งเสริมผลิตภัณฑ์ของตัวเอง และสำหรับคนที่อยากจะเรียนเพื่อนำความรู้ไปไว้ตอบลูกค้าว่าได้สารสกัดแต่ละชนิดมาได้โดยวิธีการใด และสามารถตรวจสอบสารสำคัญได้จริงหรือไม่ รวมไปถึงคนที่ยังทำงานแฮนด์เมดไม่เป็น แต่อยู่ในแหล่งวัตถุดิบ อยากจะแปรรูปสมุนไพรของตัวเองให้อยู่ในรูปสารสกัด โดยเฉพาะคนที่ทำนาข้าว สามารถแปรรูปข้าวให้ได้สารสกัดที่ดีต่อผิว เพิ่มความชุ่มชื้น มีสารต้านอนุมูลอิสระ คืนความอ่อนเยาว์ให้แก่ผิว
คอร์สเรียนนี้คุณจะได้เรียนรู้การสกัดสมุนไพรแทบทุกประเภทไม่ว่าจะเป็น แบบสดฉ่ำน้ำ แบบสดไม่ฉ่ำน้ำ พืชสมุนไพรที่เป็นหัว หรือพืชสมุนไพรที่มีน้ำมันหอมระเหย นอกจากนี้ยังมีสมุนไพรแบบสดและแบบแห้ง
คุณจะได้เรียนรู้การสกัดสมุนไพรที่เหมาะสมสำหรับผลิตภัณฑ์แต่ละชนิด พร้อมกับสอนให้ทุกคนรู้จักการต่อยอดจากสิ่งที่สอนอีกด้วย
ดังนั้นในห้องเรียนนี้ คุณจะได้พบกับการเรียนรู้วิธีสกัดสมุนไพร ที่ครอบคลุมตั้งแต่พื้นฐาน ไปถึงขั้นต่อยอดงานวิจัย ที่ตั้งใจสอนให้ทุกคนทำง่าย ทำเป็น เข้าถึงได้ง่าย
ประโยชน์ที่ผู้เรียนจะได้รับ
1) ลดรายจ่าย จากการซื้อสารสกัดสมุนไพร
2) เพิ่มรายได้จากการขายสารสกัดสมุนไพร
3) ได้สารสกัดสมุนไพรที่มีคุณภาพ มีมาตรฐาน ตรวจสอบคุณภาพได้ และทำได้ด้วยตัวเอง
4) ได้เรียนรู้การค้นหาจุดขายของผลิตภัณฑ์แฮนด์เมด
5) เรียนรู้การใช้งานวิจัย เพื่ออ้างอิงผลิตภัณฑ์แฮนด์เมดที่เราผลิต
6) เรียนรู้การตลาดในการขายผลิตภัณฑ์เครื่องสำอางเสริมความงาม
7) สามารถตอบคำถามเชิงลึกเกี่ยวกับผลิตภัณฑ์ที่เราผลิตหรือขาย ให้กับลูกค้าของเราได้
8) สามารถประยุกต์การสกัดสมุนไพร ได้กับสมุนไพรทุกชนิด ทุกประเภท
9) สามารถนำผัก ผลไม้ สมุนไพรใกล้ตัวมาสร้างมูลค่าเพิ่ม
10) สามารถนำความรู้ไปถ่ายทอดให้กับผู้อื่น เป็นวิทยากรในชุมชน หรือสร้างคอร์สออนไลน์สอนผู้ที่สนใจต่อไป
ใครควรเรียนคอร์สออนไลน์นี้
1) คนที่ทำงานในวงการเเฮนด์เมด คนทำผลิตภัณฑ์เครื่องสำอาง ผู้ผลิต ผู้ประกอบการ ที่ใช้สารสกัดสมุนไพรในผลิตภัณฑ์ เพื่อลดค่าใช้จ่ายในการซื้อสารสกัด และมั่นใจในคุณภาพ
2) คนที่มีวัตถุดิบ อยู่ในแหล่งวัตถุดิบ มีสมุนไพร หรือหาสมุนไพรใกล้ตัวได้ง่าย เพื่อผลิตสารสกัดสมุนไพรชนิดต่างๆ ออกจำหน่ายให้ผู้ผลิตเครื่องสำอางและงานเเฮนด์เมด
3) เจ้าของฟาร์ม สวนเกษตร เเหล่งเรียนรู้ชุมชน ผู้นำชุมชน ที่จะเรียนรู้การสกัดสมุนไพรเพื่อนำความรู้ไปต่อยอดขยายผลในชุมชน เพื่อสร้างแหล่งเรียนรู้ เเหล่งท่องเที่ยวเเนวใหม่ เชิงการให้ความรู้
4) ครู อาจารย์ หรือผู้ที่อยู่ในวงการการศึกษา ที่จะนำความรู้ไปขยายผลกับนักเรียนหรือหน่วยงานราชการ
5) บุคคลทั่วไปที่อยากจะสร้างคอร์สออนไลน์ หรืออยากสร้างตัวตนผ่านโลกออนไลน์ ในรูปแบบของการให้ความรู้การสกัดสมุนไพร ที่กำลังเป็นที่นิยมของผู้คน
6) คนทำงานประจำที่อยากจะค้นหาอาชีพเสริม
7) คนที่สนใจผลิตภัณฑ์เพื่อสุขภาพและความงาม
8) คนที่รู้กระเเสสมุนไพรไทยที่มาแรงและสร้างรายได้อย่างยั่งยืน
9) คนที่เห็นช่องทางตลาดขนาดใหญ่ และความน่าสนใจของผลิตภัณฑ์จากสมุนไพรไทย
10) คนที่อยากค้นหาตัวตน เเละความชอบ รวมถึงช่องทางสร้างรายได้จากสมุนไพร
ผู้เรียนต้องมีความรู้อะไรมาก่อน
ไม่จำเป็นต้องมีความรู้ หรือพื้นฐานใดๆ เพราะห้องเรียนนี้สอนตั้งแต่เริ่มต้น ปูพื้นฐานสำคัญ ไปจนถึงสอนสร้างองค์ความรู้แบบยั่งยืน จนสามารถต่อยอดได้จนถึงขั้นสูงสุด''',
};

const List<dynamic> mockDataClassFavoriteList = [];
const dynamic mockDataClassFavorite = {
  'title': 'เกษตร D.I.YOnline by Onsite เกษตรยุค New Normal',
  'imageUrl': '',
  'description':
      'เกษตร D.I.YOnline by Onsite เกษตรยุค New Normal เกษตร D.I.YOnline by Onsite เกษตรยุค New Normal เกษตร D.I.YOnline by Onsite เกษตรยุค New Normal',
};

final List<String> mockBannerList = [
  'https://raot.we-builds.com/raot-document/images/event/event_234710853.png',
  'https://raot.we-builds.com/raot-document/images/event/event_231013260.jpg',
  'https://raot.we-builds.com/raot-document/images/event/event_230539141.jpg',
  'https://raot.we-builds.com/raot-document/images/event/event_235223817.png',
];

mockCreateProfileData() async {
  await ManageStorage.createProfile(
    value: {
      'code': '1',
      'firstName': 'รักการ',
      'lastName': 'บริการ',
      'imageUrl':
          'https://raot.we-builds.com/raot-document/images/event/event_235442373.jpeg',
    },
    key: 'guest',
  );
}

// ------- mock Booking -----------------------------------------------------------------------------

// MockReservation().statusData().asMap().map((i, element) => MapEntry(i, const SizedBox())).values.toList()
class MockReservation {
  List<dynamic> statusData() {
    final random = Random();
    const statusCodeList = [0, 1, 2];

    List<dynamic> data = [];
    int a = 1;
    for (var i = 1; i < 27; i++) {
      if (a == 7) {
        a = 0;
      }
      data.add({
        'title': 'A$i',
        'status': statusCodeList[random.nextInt(statusCodeList.length)],
        'margin': a == 4 ? true : false,
      });
      a++;
    }

    return data;
  }
}

class OperationalMockData {
  final typeImage = <dynamic>[
    {
      "id": 0,
      "code": "businessLeave",
      "title": "ลากิจ",
      "type": "leave",
      "imageUrl": "assets/images/ลากิจ.png",
    },
    {
      "id": 1,
      "code": "sickLeave",
      "title": "ลาป่วย",
      "type": "leave",
      "imageUrl": "assets/images/ลาป่วย.png",
    },
    {
      "id": 2,
      "code": "takeAnnualLeave",
      "title": "ลาพักร้อน",
      "type": "leave",
      "imageUrl": "assets/images/ลาพักร้อน.png",
    },
    {
      "id": 3,
      "code": "absentFromWork",
      "title": "ขาดงาน",
      "type": "absent",
      "imageUrl": "assets/images/ขาดงาน.png",
    },
    {
      "id": 4,
      "code": "lateToWork",
      "title": "เข้่างานสาย",
      "type": "work",
      "imageUrl": "assets/images/เข้างานสาย.png",
    },
  ];

  final dynamic mockData = {
    "jobStart": "08 พ.ค. 2020",
    "period": "1 ปี 4 เดือน",
    "operatingTime": "00 hr",
    "remainingLeave": "9 วัน",
    "activityAll": <dynamic>[
      {
        "id": 0,
        "code": "businessLeave",
        "title": "ลากิจ",
        "type": "leave",
        "count": 3,
        "remaining": 3,
        "activityLatest": formateDateTHShort('20220608'),
        "imageUrl": "assets/images/ลากิจ.png",
        "list": [
          {
            "title": "ลากิจ",
            'date': formateDateTHShort('20220608'),
            "imageUrl": "assets/images/ลากิจ.png",
            'remark': '-',
            'isActive': true,
          },
          {
            "title": "ลากิจ",
            'date': formateDateTHShort('20220411'),
            "imageUrl": "assets/images/ลากิจ.png",
            'remark': 'ลาทำกิจส่วนตัว',
            'isActive': true,
          },
          {
            "title": "ลากิจ",
            'date': formateDateTHShort('20220103'),
            "imageUrl": "assets/images/ลากิจ.png",
            'remark': 'ยกเลิกโดยตนเอง',
            'isActive': false,
          },
        ],
      },
      {
        "id": 1,
        "code": "sickLeave",
        "title": "ลาป่วย",
        "type": "leave",
        "count": 2,
        "remaining": 28,
        "activityLatest": formateDateTHShort('20220508'),
        "imageUrl": "assets/images/ลาป่วย.png",
        "list": [
          {
            "title": "ลาป่วย",
            'date': formateDateTHShort('20220508'),
            "imageUrl": "assets/images/ลาป่วย.png",
            'remark': 'หาหมอ',
            'isActive': true,
          },
          {
            "title": "ลาป่วย",
            'date': formateDateTHShort('20220412'),
            "imageUrl": "assets/images/ลาป่วย.png",
            'remark': 'หาหมอ',
            'isActive': true,
          },
        ],
      },
      {
        "id": 2,
        "code": "takeAnnualLeave",
        "title": "ลาพักร้อน",
        "type": "leave",
        "count": 2,
        "remaining": 4,
        "activityLatest": formateDateTHShort('20220621'),
        "imageUrl": "assets/images/ลาพักร้อน.png",
        "list": [
          {
            "title": "ลาพักร้อน",
            'date': formateDateTHShort('20220621'),
            "imageUrl": "assets/images/ลาพักร้อน.png",
            'remark': '-',
            'isActive': true,
          },
          {
            "title": "ลาพักร้อน",
            'date': formateDateTHShort('20220211'),
            "imageUrl": "assets/images/ลาพักร้อน.png",
            'remark': 'ลากลับบ้าน',
            'isActive': true,
          },
        ],
      },
      {
        "id": 3,
        "code": "absentFromWork",
        "title": "ขาดงาน",
        "type": "absent",
        "count": 1,
        "remaining": 0,
        "activityLatest": formateDateTHShort('20220119'),
        "imageUrl": "assets/images/ขาดงาน.png",
        "list": [
          {
            "title": "ขาดงาน",
            'date': formateDateTHShort('20220119'),
            "imageUrl": "assets/images/ขาดงาน.png",
            'remark': 'มีธุระเร่งด่วน',
            'isActive': true,
          },
        ],
      },
      {
        "id": 4,
        "code": "lateToWork",
        "title": "เข้่างานสาย",
        "type": "work",
        "count": 1,
        "remaining": 4,
        "activityLatest": formateDateTHShort('20220319'),
        "imageUrl": "assets/images/เข้างานสาย.png",
        "list": [
          {
            "title": "เข้่างานสาย",
            'date': formateDateTHShort('20220319'),
            "imageUrl": "assets/images/เข้างานสาย.png",
            'remark': 'เกิดอุบัติเหตุ',
            'isActive': true,
          },
        ],
      },
    ],
  };

  List<dynamic> mockSearch(String date) {
    if (int.parse(date) < 10) {
      date = '0$date';
    }
    List<dynamic> data = [];
    List<dynamic> result = [];
    mockData['activityAll'].map((e) => {data.addAll(e['list'])}).toList();
    data
        .map(
          (e) => {
            if (e['date'].substring(0, 2) == date) {result.add(e)},
          },
        )
        .toList();
    return result;
  }
}
